#Напишите программу, которая считает площадь прямоугольника, спрашивая у пользователя длину двух сторон

a = int(input('Введите длину'))
b = int(input('Введите ширину'))
print('Площадь выбранного Вами прямоугольника равна', a * b)

#Напишите программу, которая спрашивает у пользователя два числа и знак: "+" или "-".
#В зависимости от знака выводит их сумму или разницу

a = int(input('Введите первое число: '))
b = int(input('Введите второе число: '))
c = input('Плюс или минус? ')

if c == '-':
	print('Разница указанных чисел равна: ', a - b)
elif c == '+':
	print('Сумма указанных чисел равна: ', a + b)


#Напишите программу, которая выводит все кратные 5 числа между двумя пользовательскими числами

a = int(input('Введите первое число: '))
b = int(input('Введите второе число: '))
list = ''

for i in range (a, b):
	if i % 5 == 0:
		 list = list + ' ' + str(i) 
	else:
		continue


#Напишите программу, которая находит все простые числа между 0 и пользовательским числом
n = input("n=")
a = range(n+1)
a[1] = 0
lst = []

i = 2
while i <= n:
    if a[i] != 0:
        lst.append(a[i])
        for j in xrange(i, n+1, i):
            a[j] = 0
    i += 1
print lst

